init.org
* Startup config
** Early init
#+NAME: early-init
#+BEGIN_SRC elisp :tangle ~/.emacs.d/early-init.el
;; -*- lexical-binding: t; -*-
(setq package-enable-at-startup nil)

(add-to-list 'load-path (expand-file-name "lib/borg" user-emacs-directory))
(require 'borg)
(borg-initialize)


(defconst *is-mac* (eq system-type 'darwin))
(defconst *is-linux* (eq system-type 'gnu/linux))
(defconst *is-windows* (or (eq system-type 'ms-dos)
			   (eq system-type 'windows-nt)))

(defconst *spell-check-support-enabled* nil)
#+END_SRC

** Basic config
#+BEGIN_SRC elisp :tangle yes
;; -*- lexical-binding: t; -*-

(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)

(setq ring-bell-function 'ignore)
(setq inhibit-startup-screen t)

;; no file backup
(setq make-backup-files nil)

;; 自动补全括号
(electric-pair-mode t)

;; make ibuffer default
(defalias 'list-buffers 'ibuffer)

;; 自动刷新 buffer
(global-auto-revert-mode t)

;; 选中文本后输入会替换文本
(delete-selection-mode t)
#+END_SRC

** Utils
#+BEGIN_SRC elisp :tangle yes
(defun mp-elisp-mode-eval-buffer ()
  (interactive)
  (message "Evaluated buffer")
  (eval-buffer))

(define-key emacs-lisp-mode-map (kbd "C-c C-c") #'mp-elisp-mode-eval-buffer)
(define-key lisp-interaction-mode-map (kbd "C-c C-c") #'mp-elisp-mode-eval-buffer)

(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** UI config
#+BEGIN_SRC elisp :tangle yes

(tool-bar-mode -1)
(scroll-bar-mode -1)

(set-frame-width (selected-frame) 180)
(set-frame-height (selected-frame) 60)

(global-display-line-numbers-mode t)

(setq display-line-numbers-type 'relative)

#+END_SRC